#+title: Config
*** Python-Jupyter
#+begin_src emacs-lisp :tangle yes
(setq org-babel-default-header-args:jupyter-python
      '((:session . "py")
        (:kernel . "python3")
        (:noweb . "yes")
        ;; (:kernel . "wineWebScrapeEnv")
        ;; (:wrap)
        ;; (:results . "replace raw")
        (:async . "yes")
        ;; (:pandoc . "t")
        ;; (:prologue . "from sympy import *\n")
        ))
#+end_src

#+RESULTS:
: ((:session . py) (:kernel . python3) (:noweb . yes) (:async . yes))

*** Heading size:
#+begin_src emacs-lisp :tangle yes
(after! org
(custom-set-faces!
  '(org-level-1 :inherit outline-1 :height 1.4 :weight semi-bold)
  '(org-level-2 :inherit outline-2 :height 1.2 :weight semi-bold)
  '(org-level-3 :inherit outline-3 :height 1.1 :weight semi-bold)
  '(org-level-4 :inherit outline-4 :height 1.0 :weight semi-bold)
  '(org-level-5 :inherit outline-5 :height 1.0)
  '(org-code :inherit org-code :foreground "#7bc275")
  '(org-link :inherit link :foreground "maroon")
  ))
#+end_src

#+RESULTS:
| doom--customize-themes-h-9 | doom--customize-themes-h-17 |

- ~code~
- =highlight=
- +strike-thorough+
- _underline_
- /italics/

*** org definition list face color
#+begin_src emacs-lisp :tangle yes
(after! org
(custom-set-faces!
  '(org-list-dt :weight semi-bold :foreground "#bebebe")
  ))
#+end_src

#+RESULTS:
| doom--customize-themes-h-53 |

*** Text emphasis
~org-emphasis-alist~ must be set *before* org loads and is hard coded in the org module so there is no way to append to the list. Thus we need to explicitly set this variable before org load.
#+begin_src emacs-lisp :tangle yes
(setq org-emphasis-alist
      '(("!" bold)
        ("*" bold)
        ("/" italic)
        ("_" underline)
        ("=" highlight)
        ("~" org-code verbatim)
        ("+" (:strike-through t))))
#+end_src

#+RESULTS:
| ! | highlight           |          |
| * | bold                |          |
| _ | underline           |          |
| = | org-verbatim        | verbatim |
| ~ | org-code            | verbatim |
| + | (:strike-through t) |          |

=This text should be highlighted?=

*** Configure word-list sorting
In order for =ispell= to work on our =hunspell= word-list we need to have the list sorted alphabetically so we define function to sort word file:
#+begin_src emacs-lisp :tangle yes
(defun ben/try_sort_buffer (buffer-name)
  "Tries to sort buffer-name alphabetically. Won't throw an error."
  (condition-case nil
      (save-excursion
        (find-file buffer-name)
        (sort-lines nil (point-min) (point-max))
        (save-buffer)
        (kill-buffer (current-buffer)))
    (error (message "caught error"))))
#+end_src

#+RESULTS:
: ben/try_sort_buffer

We hook the sort function into startup only because there unfortunately isn't a =on-save-to-dictionary= hook.
#+begin_src emacs-lisp :tangle yes
(add-hook 'emacs-startup-hook
          (lambda ()
            (ben/try_sort_buffer "~/.hunspell_en_GB")) )
#+end_src

#+RESULTS:
| (lambda nil (ben/try_sort_buffer ~/.hunspell_en_GB)) | doom-load-packages-incrementally-h | doom-reset-file-handler-alist-h |

[[file:../.hunspell_en_GB][Link to Wordlist]]

** Display Templates
This is to stop the names getting truncated down when not in full screen.
#+begin_src emacs-lisp :tangle yes
(setq
 org-roam-node-display-template
 (format "${doom-hierarchy} %s %s"
         (propertize "${doom-type:12}" 'face 'font-lock-keyword-face)
         (propertize "${doom-tags:*}" 'face 'org-tag))
 )
#+end_src

#+RESULTS:
: ${doom-hierarchy} ${doom-type:12} ${doom-tags:*}

